IDEA StatiCa Open Model
ReinfAroundOpening.AnchorLength Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Anchor length of main bars
 Namespace: IdeaRS.OpenModel.Detail
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public double AnchorLength { get; set; }
Public Property AnchorLength As Double
	Get
	Set
public:
property double AnchorLength {
	double get ();
	void set (double value);
}
Property Value
Type: Double
See Also
Reference
ReinfAroundOpening Class
IdeaRS.OpenModel.Detail Namespace